In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -2.347006  0.895974 -0.322386  0.407593
2013-01-02  0.192383 -0.136216  0.912516  0.385788
2013-01-03  0.084541 -0.605742  0.006287 -0.694671
2013-01-04 -0.767921  0.709731  0.464007  1.126213
2013-01-05 -0.905400  1.840926 -0.107587  0.346612
2013-01-06  0.443543  1.452602 -0.014450 -0.546422

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df.head()

                   A         B         C         D
2013-01-01 -2.347006  0.895974 -0.322386  0.407593
2013-01-02  0.192383 -0.136216  0.912516  0.385788
2013-01-03  0.084541 -0.605742  0.006287 -0.694671
2013-01-04 -0.767921  0.709731  0.464007  1.126213
2013-01-05 -0.905400  1.840926 -0.107587  0.346612

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.to_numpy()

array([[-2.34700633,  0.89597407, -0.32238611,  0.40759325],
       [ 0.19238315, -0.13621574,  0.91251616,  0.38578832],
       [ 0.08454091, -0.60574167,  0.00628687, -0.69467068],
       [-0.7679206 ,  0.70973078,  0.4640075 ,  1.12621307],
       [-0.90540006,  1.84092648, -0.10758703,  0.34661198],
       [ 0.44354296,  1.45260242, -0.01444966, -0.54642166]])

In [10]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [11]:

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.549977  0.692879  0.156398  0.170852
std    1.033821  0.928497  0.450995  0.679627
min   -2.347006 -0.605742 -0.322386 -0.694671
25%   -0.871030  0.075271 -0.084303 -0.323163
50%   -0.341690  0.802852 -0.004081  0.366200
75%    0.165423  1.313445  0.349577  0.402142
max    0.443543  1.840926  0.912516  1.126213

In [12]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.407593 -0.322386  0.895974 -2.347006
2013-01-02  0.385788  0.912516 -0.136216  0.192383
2013-01-03 -0.694671  0.006287 -0.605742  0.084541
2013-01-04  1.126213  0.464007  0.709731 -0.767921
2013-01-05  0.346612 -0.107587  1.840926 -0.905400
2013-01-06 -0.546422 -0.014450  1.452602  0.443543

In [13]:
df["A"]

2013-01-01   -2.347006
2013-01-02    0.192383
2013-01-03    0.084541
2013-01-04   -0.767921
2013-01-05   -0.905400
2013-01-06    0.443543
Freq: D, Name: A, dtype: float64

In [14]:
df[0:3]

                   A         B         C         D
2013-01-01 -2.347006  0.895974 -0.322386  0.407593
2013-01-02  0.192383 -0.136216  0.912516  0.385788
2013-01-03  0.084541 -0.605742  0.006287 -0.694671

In [15]:
df.loc[dates[0]]

A   -2.347006
B    0.895974
C   -0.322386
D    0.407593
Name: 2013-01-01 00:00:00, dtype: float64

In [16]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -2.347006  0.895974
2013-01-02  0.192383 -0.136216
2013-01-03  0.084541 -0.605742
2013-01-04 -0.767921  0.709731
2013-01-05 -0.905400  1.840926
2013-01-06  0.443543  1.452602

In [17]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.192383 -0.136216
2013-01-03  0.084541 -0.605742
2013-01-04 -0.767921  0.709731

In [18]:
df.loc[dates[0], "A"]

np.float64(-2.3470063346624643)

In [19]:
df.at[dates[0], "A"]

np.float64(-2.3470063346624643)

In [20]:
df.iloc[3]

A   -0.767921
B    0.709731
C    0.464007
D    1.126213
Name: 2013-01-04 00:00:00, dtype: float64

In [21]:
df

                   A         B         C         D
2013-01-01 -2.347006  0.895974 -0.322386  0.407593
2013-01-02  0.192383 -0.136216  0.912516  0.385788
2013-01-03  0.084541 -0.605742  0.006287 -0.694671
2013-01-04 -0.767921  0.709731  0.464007  1.126213
2013-01-05 -0.905400  1.840926 -0.107587  0.346612
2013-01-06  0.443543  1.452602 -0.014450 -0.546422

In [22]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.767921  0.709731
2013-01-05 -0.905400  1.840926

In [23]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)


df

        A  B    C         D         E
0     one  A  foo -1.104451 -0.328539
1     one  B  foo  1.861063 -0.516402
2     two  C  foo  0.793966  0.813698
3   three  A  bar -0.519877 -1.052643
4     one  B  bar  0.267459 -0.250467
5     one  C  bar  0.204206  0.626774
6     two  A  foo -1.035303  0.078884
7   three  B  foo -0.018614  0.350265
8     one  C  foo -0.858636  1.341167
9     one  A  bar  0.473794 -0.965491
10    two  B  bar  0.058537 -1.794885
11  three  C  bar  1.725209 -0.130046

In [24]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.473794 -1.104451
      B  0.267459  1.861063
      C  0.204206 -0.858636
three A -0.519877       NaN
      B       NaN -0.018614
      C  1.725209       NaN
two   A       NaN -1.035303
      B  0.058537       NaN
      C       NaN  0.793966

In [ ]:
import pandas as pd